{
  "apple": "Apples grow in well-drained loamy soil with a cool climate. Fertilize with 50-40-40 kg/ha NPK. Ensure regular watering, especially during flowering. Prune trees to encourage growth and manage pests organically. Harvest when fruits mature and store in cool, dry conditions. Rotate crops and use compost to maintain soil health for consistent, high-quality apple yields.",
  "orange": "Oranges thrive in sandy-loam soil with warm temperatures. Fertilize with 100-40-60 kg/ha NPK annually. Water moderately and avoid waterlogging. Protect trees from pests like aphids using neem-based sprays. Harvest when fruits are firm and bright. Store in cool conditions. Organic composting improves soil fertility, ensuring sustainable citrus farming and enhancing productivity over growing cycles.",
  "papaya": "Papayas grow well in sandy-loam soil with good drainage and a warm climate. Fertilize with 100-40-40 kg/ha NPK. Water regularly but avoid over-irrigation. Use organic pest control to prevent diseases. Harvest when fruits turn yellow and firm. Maintain soil health with compost and mulch, promoting sustainable yields and long-term papaya production for better farming outcomes.",
  "coconut": "Coconuts require sandy soil with high water retention and a tropical climate. Apply 500-320-1200 g/tree NPK annually. Irrigate regularly, especially during dry spells. Control pests like mites with neem sprays. Harvest mature nuts for oil or copra. Use compost and mulch for soil improvement. Intercropping with legumes enhances productivity and sustainability over multiple growing seasons.",
  "cotton": "Cotton thrives in black, well-drained soil with warm weather. Fertilize with 60-30-30 kg/ha NPK. Water moderately and avoid waterlogging. Use organic methods to control bollworms and aphids. Harvest when bolls burst, ensuring fibers are dry. Rotate crops with cereals to maintain soil health and prevent pest buildup, ensuring consistent and sustainable cotton yields.",
  "jute": "Jute grows in loamy, water-retentive soil with a warm, humid climate. Fertilize with 40-20-20 kg/ha NPK. Irrigate regularly, avoiding prolonged flooding. Control pests like stem borers with neem oil. Harvest when stalks mature and process fibers promptly. Rotate crops with legumes or cereals to enhance soil fertility, ensuring sustainable production and better jute quality.",
  "coffee": "Coffee thrives in well-drained loamy soil under shade. Fertilize with 100-40-100 kg/ha NPK annually. Irrigate consistently but avoid waterlogging. Prune plants regularly and control pests like white stem borers organically. Harvest ripe cherries for quality beans. Use compost to improve soil nutrients, ensuring long-term sustainability and optimal coffee yields across different growing conditions.",
  "soyabeans": "Soybeans grow in fertile, well-drained soil with a temperate climate. Fertilize with 20-60-40 kg/ha NPK. Irrigate moderately and ensure proper drainage. Manage pests like aphids with organic methods. Harvest when pods dry. Rotate with cereals to improve soil nitrogen. Mulching and organic practices enhance sustainability, ensuring high yields and better soybean crop productivity over time.",
  "beans": "Beans grow well in loamy, well-drained soil with adequate sunlight. Fertilize with 30-50-40 kg/ha NPK. Provide moderate watering and control pests like aphids organically. Harvest pods when fully mature and dry seeds for storage. Rotate with cereals or legumes to enhance soil fertility, ensuring sustainable practices for consistent and productive bean farming cycles.",
  "peas": "Peas prefer sandy-loam soil and cool weather. Fertilize with 20-40-40 kg/ha NPK. Water moderately, avoiding waterlogging. Use organic methods to control aphids and pests. Harvest pods when plump, and sun-dry seeds before storage. Crop rotation with cereals improves soil health, maintaining nitrogen levels and ensuring sustainable pea cultivation with enhanced yields and better quality produce.",
  "groundnuts": "Groundnuts thrive in sandy-loam soil and warm climates. Fertilize with 20-40-20 kg/ha NPK. Provide light irrigation, avoiding waterlogging. Protect against pests using neem sprays. Harvest when plants turn yellow and pods mature. Rotate with cereals to replenish soil nutrients. Mulching helps retain moisture, supporting sustainable groundnut farming and ensuring better productivity across growing seasons.",
  "cowpeas": "Cowpeas grow in sandy-loam soil and require minimal water. Fertilize with 20-40-20 kg/ha NPK. Control aphids with neem-based treatments. Harvest when pods are mature and dry seeds for storage. Rotate with cereals to improve soil nitrogen levels. This drought-tolerant crop ensures sustainability and supports long-term agricultural productivity in arid or semi-arid regions.",
    "rice": "Rice grows in clay or loamy soil with high water retention. Requires a warm, humid climate. Fertilize with 100-50-50 kg/ha NPK. Maintain flooded fields during the growing stage. Harvest when grains turn golden. Use crop rotation and organic practices to improve soil health, ensuring high yields and sustainable rice production over multiple seasons.",
    "maize": "Maize thrives in loamy soil and moderate temperatures. Fertilize with 120-60-40 kg/ha NPK. Irrigate adequately, avoiding waterlogging. Protect against pests like stem borers using organic sprays. Harvest when cobs mature and kernels dry. Rotate crops to maintain soil fertility. Sustainable practices ensure consistent yields and high-quality maize production over successive growing cycles.",
    "chickpea": "Chickpeas require well-drained loamy soil and a cool climate. Fertilize with 20-40-20 kg/ha NPK. Irrigate sparingly, as the crop is drought-tolerant. Control pests like aphids using neem oil. Harvest when pods dry. Rotate with cereals to replenish soil nutrients. Sustainable cultivation enhances productivity and ensures high-quality chickpea harvests in subsequent seasons.",
    "kidneybeans": "Kidney beans grow in sandy-loam soil with good drainage and moderate climate. Fertilize with 40-80-40 kg/ha NPK. Water moderately and avoid standing water. Use organic sprays for pest control. Harvest when pods mature. Rotate with cereals to enhance soil health. This practice supports consistent yields and ensures sustainability in kidney bean farming.",
    "pigeonpeas": "Pigeonpeas thrive in loamy soil with moderate water retention. Fertilize with 20-50-20 kg/ha NPK. Tolerant to drought, but irrigate lightly when needed. Manage pests like pod borers using organic methods. Harvest when pods dry. Crop rotation with cereals improves soil health, ensuring better pigeonpea yields and sustainable farming practices over time.",
    "mothbeans": "Moth beans grow in sandy soil and thrive in arid climates. Fertilize with 20-30-20 kg/ha NPK. Drought-tolerant, they require minimal irrigation. Protect against pests like beetles with organic sprays. Harvest when pods mature and dry seeds for storage. Sustainable cultivation improves soil health, supporting productive moth bean farming in harsh conditions.",
    "mungbean": "Mungbeans prefer sandy-loam soil with adequate sunlight. Fertilize with 20-40-20 kg/ha NPK. Irrigate sparingly and avoid waterlogging. Control pests like aphids using neem oil. Harvest when pods dry. Rotate crops to improve soil fertility. Sustainable practices ensure consistent mungbean yields and promote better soil health for future planting seasons.",
    "blackgram": "Blackgram grows in loamy soil with good drainage. Fertilize with 20-40-20 kg/ha NPK. Water moderately, avoiding waterlogging. Use organic sprays to control aphids and pests. Harvest when pods dry. Rotate with cereals to enhance nitrogen levels in the soil. This ensures sustainable blackgram farming and maintains soil health for higher productivity.",
    "lentil": "Lentils thrive in sandy-loam soil with moderate water needs. Fertilize with 20-40-20 kg/ha NPK. Provide limited irrigation, as lentils are drought-tolerant. Control pests like aphids organically. Harvest when pods dry. Rotate crops to maintain soil fertility and nitrogen levels, ensuring sustainable and productive lentil farming practices across growing seasons.",
    "pomegranate": "Pomegranates grow well in loamy soil with good drainage and warm climates. Fertilize with 50-40-50 kg/ha NPK. Irrigate moderately, especially during flowering. Use organic sprays to control pests. Harvest when fruits turn red and firm. Prune trees regularly to promote growth. Sustainable practices enhance yields and improve pomegranate quality over successive planting cycles.",
    "banana": "Bananas thrive in loamy, well-drained soil with high organic matter. Fertilize with 200-100-200 kg/ha NPK. Ensure consistent irrigation and avoid waterlogging. Use organic pest control methods to manage diseases. Harvest when fruits mature and green. Mulching and crop rotation improve soil health, ensuring sustainable banana cultivation and consistent productivity.",
    "mango": "Mangoes prefer sandy-loam soil with good drainage. Fertilize with 40-30-40 kg/ha NPK. Irrigate during flowering but avoid waterlogging. Use organic pest control methods to protect trees. Harvest when fruits mature and are slightly soft. Prune regularly to encourage growth. Sustainable practices improve soil health and ensure long-term mango tree productivity.",
    "grapes": "Grapes grow in sandy-loam soil with good drainage and a warm climate. Fertilize with 80-60-40 kg/ha NPK. Irrigate moderately and avoid standing water. Use organic sprays to control pests and diseases. Harvest when fruits are firm and sweet. Prune vines regularly. Crop rotation and organic farming improve soil health and grape quality.",
    "watermelon": "Watermelons require sandy-loam soil with good drainage and warm weather. Fertilize with 80-40-40 kg/ha NPK. Irrigate regularly but avoid overwatering. Protect against pests like aphids using neem-based treatments. Harvest when fruits sound hollow when tapped. Organic practices enhance soil fertility, ensuring sustainable watermelon farming and consistent yields.",
    "muskmelon": "Muskmelons grow in sandy-loam soil with a warm climate. Fertilize with 50-30-20 kg/ha NPK. Irrigate moderately, avoiding waterlogging. Use organic pest control methods to prevent diseases. Harvest when fruits emit a fragrant aroma. Mulching and crop rotation improve soil health, ensuring sustainable muskmelon farming and better-quality yields over successive planting seasons."
  }
  